//*****************************************************************************
//
// stage select bg
//
// Author		: taichi kitazawa
//
//
//*****************************************************************************

//*****************************************************************************
// include guard
//*****************************************************************************
#pragma once
#ifndef _SELECT_ARROW_LEFT_H_
#define _SELECT_ARROW_LEFT_H_

//*****************************************************************************
// include
//*****************************************************************************
#include "basic/basic.h"

//*****************************************************************************
// forward declaration
//*****************************************************************************
class Sprite;

//*****************************************************************************
// class definition
//*****************************************************************************
class ArrowLeft : public Basic
{
public:
	// constructor
	ArrowLeft(void);

	// destructor
	virtual ~ArrowLeft(void);

	// initialize
	bool Initialize(void);

	// uninitialize
	void Uninitialize(void);

	// update
	void Update(void);

	// draw
	void Draw(void);


private:
	Sprite* arrow_left_;
	u32 time_;		//点滅する時間をみるもの
	u32 alpha_;		//アルファ値



};

#endif	// _select_BG_H_

//---------------------------------- EOF --------------------------------------
