//*****************************************************************************
//
// scene title
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// include
//*****************************************************************************
#include "scene_title.h"
#include "scene/factory/scene_factory.h"
#include "title_bg.h"
#include "system/system.h"

#define GO_LOGO_TIME	(240)		//ƒƒS‚É–ß‚é‚Ü‚Å‚ÌŽžŠÔ

//=============================================================================
// constructor
//=============================================================================
SceneTitle::SceneTitle(void) :
Scene(TYPE_TITLE)
{
}

//=============================================================================
// destructor
//=============================================================================
SceneTitle::~SceneTitle(void)
{
}

//=============================================================================
// initialize
//=============================================================================
bool SceneTitle::Initialize(void)
{
	title_bg_ = new TitleBg();
	title_bg_->Initialize();

	go_logo_time_ = 0;

	return true;
}

//=============================================================================
// uninitialize
//=============================================================================
void SceneTitle::Uninitialize(void)
{
	SafeRelease(title_bg_);

	SafeDelete(next_scene_factory_);
}

//=============================================================================
// update
//=============================================================================
void SceneTitle::Update(void)
{
	if(GET_DIRECT_INPUT->CheckTrigger(INPUT_EVENT_RETURN))
	{
		if(next_scene_factory_ == nullptr)
		{
			next_scene_factory_ = new GameFactory();
		}
	}

	if(go_logo_time_ == GO_LOGO_TIME)
	{
		if(next_scene_factory_ == nullptr)
		{
			next_scene_factory_ = new LogoFactory();
		}
	}

	go_logo_time_++;
}

//=============================================================================
// draw
//=============================================================================
void SceneTitle::Draw(void)
{
	title_bg_->Draw();
}

//=============================================================================
// create factory
//=============================================================================
SceneFactory* SceneTitle::CreateFactory(void)const
{
	return new TitleFactory();
}

//---------------------------------- EOF --------------------------------------
