//*****************************************************************************
//
// 共通処理
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// include gaurd
//*****************************************************************************
#pragma once

#ifndef _DEFAULT_CONSTANT_DEFINITION_H_
#define _DEFAULT_CONSTANT_DEFINITION_H_

//*****************************************************************************
// constant definition
//*****************************************************************************
const static s32 DEFAULT_FAIL = (-1);					// 失敗した時
const static u32 DEFAULT_SCREEN_WIDTH	= (1280);		// スクリーン横幅
const static u32 DEFAULT_SCREEN_HEIGHT	= (720);		// スクリーン縦幅
const static f32 DEFAULT_GRAVITY	= (3.0f);			// 重力

#endif	// _DEFAULT_CONSTANT_DEFINITION_H_

//---------------------------------- EOF --------------------------------------
