//*****************************************************************************
//
// title bg
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// include guard
//*****************************************************************************
#pragma once
#ifndef _LOGO_LOGO_H_
#define _LOGO_LOGO_H_

//*****************************************************************************
// include
//*****************************************************************************
#include "basic/basic.h"

//*****************************************************************************
// forward declaration
//*****************************************************************************
class Sprite;

//*****************************************************************************
// class definition
//*****************************************************************************
class Logo : public Basic
{
public:
	// constructor
	Logo(void);

	// destructor
	virtual ~Logo(void);

	// initialize
	bool Initialize(void);

	// uninitialize
	void Uninitialize(void);

	// update
	void Update(void);

	// draw
	void Draw(void);


	bool __next_scene_flag(void){return next_scene_flag_;};

private:
	Sprite* logo_neko_;		//ロゴ
	u32 logo_timer_;		//ロゴ切り替えタイマー
	bool next_scene_flag_;	//タイトルに進むかな？

};

#endif	// _TITLE_BG_H_

//---------------------------------- EOF --------------------------------------
